holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Switch Output INS
    result.sw_output_ins = create_switch(
        row_output_ins,
        obj_w_1,
        row_height,
        LV_ALIGN_CENTER,
        0,
        0
    );
    lv_obj_add_event_cb(result.sw_output_ins, sw_output_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    lv_obj_set_size(result.lbl_output_ins, obj_w_0, obj_height);
    lv_obj_set_size(result.sw_output_ins, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Title Gyro                                                 */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_title_output_gyro = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Adjust Flex
    lv_obj_set_flex_flow(row_title_output_gyro, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(
        row_title_output_gyro,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER
    );

    // Label
    result.lbl_title_output_gyro = create_label(
        row_title_output_gyro,
        title_width,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "GYRO",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_title_hue,
        default_title_hue
    );

    lv_obj_set_size(result.lbl_title_output_gyro, title_width, obj_height);

    /* ---------------------------------------------------------- */
    /* Output GYRO 0                                              */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_output_gyro_0 = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Adjust Flex
    lv_obj_set_flex_flow(row_output_all, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(
        row_output_all,
        LV_FLEX_ALIGN_START,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER
    );

    // Label Output GYRO 0
    result.lbl_output_gyro_0 = create_label(
        row_output_gyro_0,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "OUTPUT GYRO 0",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    // Switch Output GYRO 0
    result.sw_output_gyro_0 = create_switch(
        row_output_gyro_0,
        obj_w_1,
        row_height,
        LV_ALIGN_CENTER,
        0,
        0
    );
    lv_obj_add_event_cb(result.sw_output_gyro_0, sw_output_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    lv_obj_set_size(result.lbl_output_gyro_0, obj_w_0, obj_height);
    lv_obj_set_size(result.sw_output_gyro_0, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Title AUX                                                  */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_title_output_aux = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Adjust Flex
    lv_obj_set_flex_flow(row_title_output_aux, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(
        row_title_output_aux,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER
    );

    // Label Output all
    result.lbl_title_output_aux = create_label(
        row_title_output_aux,
        title_width,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "MATRIX & AUX",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_title_hue,
        default_title_hue
    );

    lv_obj_set_size(result.lbl_title_output_aux, title_width, obj_height);

    /* ---------------------------------------------------------- */
    /* Output MATRIX                                              */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_output_matrix = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Adjust Flex
    lv_obj_set_flex_flow(row_output_all, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(
        row_output_all,
        LV_FLEX_ALIGN_START,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER
    );

    // Label Output MATRIX
    result.lbl_output_matrix = create_label(
        row_output_matrix,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "OUTPUT MATRIX",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    // Switch Output MATRIX
    result.sw_output_matrix = create_switch(
        row_output_matrix,
        obj_w_1,
        row_height,
        LV_ALIGN_CENTER,
        0,
        0
    );
    lv_obj_add_event_cb(result.sw_output_matrix, sw_output_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    lv_obj_set_size(result.lbl_output_matrix, obj_w_0, obj_height);
    lv_obj_set_size(result.sw_output_matrix, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Output INPUT CONTROLLER                                    */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_output_input_controller = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Adjust Flex
    lv_obj_set_flex_flow(row_output_all, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(
        row_output_all,
        LV_FLEX_ALIGN_START,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER
    );

    // Label Output INPUT CONTROLLER
    result.lbl_output_input_controller = create_label(
        row_output_input_controller,
        obj_w_0,
        obj_height,
        LV_ALIGN_CENTER,
        0,
        0,
        "OUTPUT INPUT CONTROLLER",
        LV_TEXT_ALIGN_CENTER,
        &cobalt_alien_17,
        false,
        false,
        false,
        2,
        general_radius,
        1,
        default_bg_hue,
        default_subtitle_hue
    );

    // Switch Output INPUT CONTROLLER
    result.sw_output_input_controller = create_switch(
        row_output_input_controller,
        obj_w_1,
        row_height,
        LV_ALIGN_CENTER,
        0,
        0
    );
    lv_obj_add_event_cb(result.sw_output_input_controller, sw_output_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    lv_obj_set_size(result.lbl_output_input_controller, obj_w_0, obj_height);
    lv_obj_set_size(result.sw_output_input_controller, obj_w_1, obj_height);

    /* ---------------------------------------------------------- */
    /* Output ADMplex 0                                           */
    /* ---------------------------------------------------------- */

    lv_obj_t * row_output_admplex_0 = create_row(
        result.panel,
        sub_row_width,
        sub_row_height,
        inner_pad_all,
        sub_row_padding,
        sub_column_padding,
        false,
        false
    );

    // Adjust Flex
    lv_obj_set_flex_flow(row_output_all, LV_FLEX_FLOW_ROW);
    lv_obj_set_flex_align(
        row_output_all,
        LV_FLEX_ALIGN_START,
        LV_FLEX_ALIGN_CENTER,
        LV_FLEX_ALIGN_CENTER
    );

