holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // #############################################################################################
    // COORD
    // #############################################################################################

    result.latitude_label = create_label(
        result.panel,         // parent
        200,                  // width
        20,                   // height
        LV_ALIGN_BOTTOM_LEFT, // parent alignment
        0,                    // pos x
        -20,                  // pos y
        "LAT ",               // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &Mono_Bold_14,     // font
        true,                 // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        0,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_value_hue
    );

    result.longitude_label = create_label(
        result.panel,         // parent
        200,                  // width
        20,                   // height
        LV_ALIGN_BOTTOM_LEFT, // parent alignment
        0,                    // pos x
        0,                    // pos y
        "LON ",               // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &Mono_Bold_14,     // font
        true,                 // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        0,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_value_hue
    );

    result.speed_label = create_label(
        result.panel,         // parent
        200,                  // width
        20,                   // height
        LV_ALIGN_BOTTOM_MID,  // parent alignment
        0,                    // pos x
        0,                  // pos y
        "SPD ",               // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &Mono_Bold_14,     // font
        true,                 // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        0,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_value_hue
    );

    result.altitude_label = create_label(
        result.panel,         // parent
        200,                  // width
        20,                   // height
        LV_ALIGN_BOTTOM_MID,  // parent alignment
        0,                    // pos x
        -20,                  // pos y
        "ALT ",               // initial text
        LV_TEXT_ALIGN_LEFT,   // font alignment
        &Mono_Bold_14,     // font
        true,                 // transparent background
        false,                // show scrollbar
        false,                // enable scrolling
        0,                    // outline width
        general_radius,       // outline radius
        1,
        default_bg_hue,
        default_value_hue
    );

    return result;
}

/** -------------------------------------------------------------------------------------
 * @brief Create Image Loaded from SD Card.
 *
 * @param parent Specify parent object.
 * @param filename Path/filename on SD card.
 * @param width_px Display width.
 * @param height_px Display height.
 * @param color_depth_bits Color depth (16, 32, etc.).
 * @param pos_x Offset from alignment.
 * @param pos_y Offset from alignment.
 * @param alignment Image alignment on parent.
 * @param discard_after_display Free image data after first display (memory optimization).
 * @return sdcard_image_t* Pointer to image info structure (or NULL on failure).
 */
sdcard_image_t * create_image_from_sdcard(
    lv_obj_t * parent,
    const char * filename,
    uint32_t width_px,
    uint32_t height_px,
    uint32_t color_depth_bits,
    uint32_t pos_x,
    uint32_t pos_y,
    lv_align_t alignment,
    bool discard_after_display
) {

    // Allocate sdcard_image_t structure
    sdcard_image_t * sdcard_image = (sdcard_image_t *)heap_caps_malloc(sizeof(sdcard_image_t), MALLOC_CAP_SPIRAM);
    if (!sdcard_image) {
        return NULL;
    }

    // Get file size
    sdcard_image->f_size = get_file_size(filename);
    if (sdcard_image->f_size == 0) {
        heap_caps_free(sdcard_image);
        return NULL;
    }

    // Load image to PSRAM
    sdcard_image->bytes_in_psram = load_file_bytes_to_psram(filename, sdcard_image->f_size);
    if (!sdcard_image->bytes_in_psram) {
        heap_caps_free(sdcard_image);
        return NULL;
    }

    // Create descriptor from loaded data
    sdcard_image->dsc.header.cf = color_depth_bits == 24 ? LV_COLOR_FORMAT_RGB565A8 : LV_COLOR_FORMAT_RGB565;
    sdcard_image->dsc.header.w = width_px;
    sdcard_image->dsc.header.h = height_px;
    sdcard_image->dsc.data_size = sdcard_image->f_size;
    sdcard_image->dsc.data = sdcard_image->bytes_in_psram; // Pointer to PSRAM data

    // Create LVGL image object
    sdcard_image->lv_image_obj = lv_img_create(parent);
    if (!sdcard_image->lv_image_obj) {
        heap_caps_free(sdcard_image->bytes_in_psram);
        heap_caps_free(sdcard_image);
        return NULL;
    }

    // Position and size
    lv_obj_set_pos(sdcard_image->lv_image_obj, pos_x, pos_y);
    if (alignment == LV_ALIGN_CENTER) {
        lv_obj_center(sdcard_image->lv_image_obj);
    }
    lv_obj_set_size(sdcard_image->lv_image_obj, width_px, height_px);
    
    // Set image source
    lv_img_set_src(sdcard_image->lv_image_obj, &sdcard_image->dsc);

    // Discard or return
    if (discard_after_display) {
        heap_caps_free(sdcard_image->bytes_in_psram);
        heap_caps_free(sdcard_image);
        return NULL;  // Return NULL when discarding
    }
    return sdcard_image;  // Return full structure
}

/** -------------------------------------------------------------------------------------
 * @brief  Free's loading image from memor
 */
void cleanup_loading_image() {
    if (loading_image) {
        // Delete LVGL image object
        if (loading_image->lv_image_obj) {
            lv_obj_del(loading_image->lv_image_obj);
        }
        // Free PSRAM image data
        if (loading_image->bytes_in_psram) {
            heap_caps_free(loading_image->bytes_in_psram);
        }
        // Free the struct itself
        heap_caps_free(loading_image);
        loading_image = NULL;
    }
}

/** -------------------------------------------------------------------------------------
 * @brief  An intermediary function used with loading screens.
 */
void lvgl_cleanup_all() {
    // Ensure no pending events
    lv_timer_handler();
    
    cleanup_loading_image();
    astro_clock_end();
}

/** -------------------------------------------------------------------------------------
 * @brief Create Default Screen Objects.
 *
 * Initializes and places all default UI elements on the given parent screen.
 *
 * @param parent Specify parent object (usually the active screen).
 * @return Void.
 */
void create_default_screen_objects(
    lv_obj_t * parent
    )
{

    lvgl_cleanup_all();

    // Set background color for main part of the screen
    lv_obj_set_style_bg_color(parent, lv_color_make(0, 0, 0), LV_PART_MAIN);

    // -------------------------------- Keypad Num ------------------------------------ //

    // Create keyboard (bootstrapped)
    kb_numdec = create_keyboard(
        parent,                  // lv_obj_t
        600,                     // width px
        250,                     // height px
        LV_ALIGN_CENTER,         // alignment
        0,                       // pos x
        23,                      // pos y
        10,                      // padding between kb and text area
        36,                      // text area height
        LV_KEYBOARD_MODE_NUMBER, // keyboard mode
        &cobalt_alien_25,
        &cobalt_alien_17
    );
    
    // Plug in keyboard callback for kb_numdec
    lv_obj_add_event_cb(kb_numdec.kb, keyboard_event_cb, LV_EVENT_VALUE_CHANGED, &kb_numdec);
    lv_obj_add_flag(kb_numdec.kb, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(kb_numdec.ta, LV_OBJ_FLAG_HIDDEN);

    // -------------------------------- Keyboard ----------------------------------- //

    // Create keyboard (bootstrapped)
    kb_alnumsym = create_keyboard(
        parent,                  // lv_obj_t
        600,                     // width px
        250,                     // height px
        LV_ALIGN_CENTER,         // alignment
        0,                       // pos x
        23,                      // pos y
        10,                      // padding between kb and text area
        36,                      // text area height
        LV_KEYBOARD_MODE_USER_1, // keyboard mode
        &cobalt_alien_25,
        &cobalt_alien_17
    );
    
    // Plug in keyboard callback for kb_alnumsym
    lv_obj_add_event_cb(kb_alnumsym.kb, keyboard_event_cb, LV_EVENT_VALUE_CHANGED, &kb_alnumsym);
    lv_obj_add_flag(kb_alnumsym.kb, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(kb_alnumsym.ta, LV_OBJ_FLAG_HIDDEN);

    // -------------------------------- Title Bar --------------------------------- //

    // uncomment if using a perimeter clock
    // if (current_screen_number != HOME_SCREEN) {
        main_title_bar = create_title_bar(
            parent, // parent
            720, // width px
            64,  // height px
            LV_ALIGN_TOP_MID,
            0, // pos x
            0, // pos y
            false, // show scrollbar
            false,  // enable scrollbar
            &cobalt_alien_25,
            &cobalt_alien_17
        );
    // } else {
    //     main_title_bar.panel = NULL;
    // }

    // ------------------------------ System Tray --------------------------------- //

    // Create system tray
    system_tray = create_system_tray(
        parent,
        &cobalt_alien_25,
        &cobalt_alien_17
    );

    // Plug in event callback for screen click events
    lv_obj_add_event_cb(parent, screen_tap_cb, LV_EVENT_CLICKED, NULL);

    // Plug in event callback for screen swipe events
    lv_obj_add_event_cb(parent, screen_swipe_cb, LV_EVENT_GESTURE, NULL);
}

/** -------------------------------------------------------------------------------------
 * @brief Show Loading Screen.
 */
void display_loading_screen() {

    lv_obj_t * current_screen = lv_scr_act();

    if (!lv_obj_is_valid(loading_screen)) {loading_screen = lv_obj_create(NULL);}
    if (current_screen == loading_screen) return;

    current_screen_number = LOAD_SCREEN;

    lv_obj_set_style_bg_color(loading_screen, lv_color_make(0, 0, 0), LV_PART_MAIN);
    
