holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Create image from sdcard and store reference for cleanup
    loading_image = create_image_from_sdcard(
        loading_screen,      // parent object
        "/sdcard/logo1.bin", // filepath
        600,                 // width_px
        600,                 // height_px
        16,                  // color_depth_bits
        0,                   // pos_x
        0,                   // pos_y
        LV_ALIGN_CENTER,     // alignment
        false                // keep in memory until cleanup
    );
    
    lv_scr_load(loading_screen);
}

/** -------------------------------------------------------------------------------------
 * @brief Show Home Screen.
 */
void display_home_screen()
{
    // Set Display Flag
    flag_display_home_screen = false;

    // Check Current Screen
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == home_screen) {
        return;
    }

    current_screen_number = HOME_SCREEN;

    // Always create a fresh screen
    home_screen = lv_obj_create(NULL);
    
    // Load screen
    lv_scr_load_anim(home_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    // Defaults
    create_default_screen_objects(home_screen);

    // -------------------------------- Astro Clock ----------------------------------- //

    // Initialize astro clock on main screen
    astro_clock_begin(
        home_screen,
        550,             // outline width (total available width)
        550,             // outline height (total available height)
        550,             // astro width (span X of total available width)
        550,             // astro height (span Y of total available height)
        LV_ALIGN_CENTER, // alignment
        0,               // pos x
        0,               // pos y
        90               // angle offset
    );
}

/** -------------------------------------------------------------------------------------
 * @brief Show Matrix Screen.
 */
void display_matrix_screen()
{
    // Set Display Flag
    flag_display_matrix_screen = false;

    // Check Current Screen
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == matrix_screen) {
        return;
    }

    current_screen_number = MATRIX_SCREEN;

    // Always create a fresh screen
    matrix_screen = lv_obj_create(NULL);
    
    // Load screen
    lv_scr_load_anim(matrix_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    // Defaults
    create_default_screen_objects(matrix_screen);

    current_mapping_i = 0;
    current_matrix_i = 0;
    current_matrix_function_i = 0;

    matrix_overview_grid_1 = create_menu_grid(
        matrix_screen,        // parent screen
        15,                   // cols
        3,                    // rows
        38,                   // cell size px
        8,                    // outer padding
        8,                    // inner padding
        0,                    // pos x
        0,                    // pos y
        LV_ALIGN_CENTER,      // alignment
        radius_rounded,       // item radius px
        15,                   // max cols visible (for scrollbar)
        3,                    // max rows visible (for scrollbar)
        false,                // show scrollbar
        false,                // enable scrolling
        LV_TEXT_ALIGN_CENTER, // text align
        &cobalt_alien_17,     // font for labels
        true,
        false
    );
    // Plug in general event callback handler
    uint32_t grid_menu_x_count = lv_obj_get_child_cnt(matrix_overview_grid_1);
    for(uint32_t i = 0; i < grid_menu_x_count; i++) {
        // vTaskDelay(pdMS_TO_TICKS(5));
        lv_obj_t * btn = lv_obj_get_child(matrix_overview_grid_1, i);
        lv_obj_add_event_cb(btn, matrix_overview_grid_1_event_cb, LV_EVENT_CLICKED, NULL);
    }

    // Create Function Panel
    mfc = create_matrix_function_container(
        matrix_screen,    // parent
        520,              // width px
        410,              // height px
        LV_ALIGN_CENTER,  // alignment
        0,                // pos x
        35,               // pos y
        radius_rounded,   // radius
        0,                // outer_pad_all
        4,                // inner_pad_all
        0,                // outline_padding
        1,                // main_row_padding
        4,                // main_column_padding
        2,                // sub_row_padding
        8,                // sub_column_padding
        40,               // row height
        false,            // show scrollbar
        false,            // enable scrolling
        &cobalt_alien_25, // font for titles,
        &cobalt_alien_17  // font for text,
    );
    lv_obj_add_flag(mfc.panel, LV_OBJ_FLAG_HIDDEN);

    // Create Mapping Panel
    mcc = create_mapping_config_container(
        matrix_screen,    // parent
        520,              // width px
        410,              // height 
        LV_ALIGN_CENTER,  // alignment
        0,                // pos x
        35,               // pos y
        radius_rounded,   // radius
        0,                // outer_pad_all
        4,                // inner_pad_all
        0,                // outline_padding
        1,                // main_row_padding
        4,                // main_column_padding
        2,                // sub_row_padding
        8,                // sub_column_padding
        40,               // row height
        true,             // show scrollbar
        false,            // enable scrolling
        &cobalt_alien_25, // font for titles,
        &cobalt_alien_17  // font for text,
    );
    lv_obj_add_flag(mcc.panel, LV_OBJ_FLAG_HIDDEN);

    // Switch Panel View
    matrix_switch_panel = create_matrix_switch_panel(
        matrix_screen,    // parent
        520,              // width px
        42,         // height px
        LV_ALIGN_CENTER,  // alignment
        0,                // pos x
        -200,             // pos y
        radius_rounded,   // radius
        0,                // outer_pad_all
        1,                // inner_pad_all
        0,                // outline_padding
        1,                // main_row_padding
        1,                // main_column_padding
        1,                // sub_row_padding
        10,               // sub_column_padding
        42,               // row height
        false,            // show scrollbar
        false,            // enable scrolling
        &cobalt_alien_25, // font for titles,
        &cobalt_alien_17  // font for text,
    );

