holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Select Matrix File Slot
    dd_matrix_file_slot_select = create_dropdown_menu(
        matrix_screen,     // parent
        satioFileData.matix_filepaths, // menu items
        10,                // number of menu items
        240,               // width px
        34,                // height px
        LV_ALIGN_TOP_MID,  // alignment
        0,                 // pos x
        90,                // pos y
        &cobalt_alien_17   // font
    );
    lv_dropdown_set_selected(dd_matrix_file_slot_select, satioFileData.i_current_matrix_file_path);
    lv_obj_add_event_cb(dd_matrix_file_slot_select, dd_matrix_file_slot_select_event_cb, LV_EVENT_VALUE_CHANGED, NULL);

    // New Matrix
    matrix_new = create_button(
        matrix_screen,        // parent
        34,                   // width px
        34,                   // height px
        LV_ALIGN_TOP_LEFT,    // alignment
        130,                  // pos x
        90,                   // pos y
        "N",                  // label text
        LV_TEXT_ALIGN_CENTER, // text align
        false,                // show scrollbar
        false,                // enable scrolling
        &cobalt_alien_17,     // font for labels,
        radius_rounded,
        default_btn_bg,
        default_btn_on_value_hue
    );
    lv_obj_add_event_cb(matrix_new.button, matrix_new_event_cb, LV_EVENT_CLICKED, NULL);

    // Save Matrix
    matrix_save = create_button(
        matrix_screen,        // parent
        34,                   // width px
        34,                   // height px
        LV_ALIGN_TOP_LEFT,    // alignment
        184,                  // pos x
        90,                   // pos y
        "S",                  // label text
        LV_TEXT_ALIGN_CENTER, // text align
        false,                // show scrollbar
        false,                // enable scrolling
        &cobalt_alien_17,     // font for labels,
        radius_rounded,
        default_btn_bg,
        default_btn_on_value_hue
    );
    lv_obj_add_event_cb(matrix_save.button, matrix_save_event_cb, LV_EVENT_CLICKED, NULL);

    // Load Matrix
    matrix_load = create_button(
        matrix_screen,        // parent
        34,                   // width px
        34,                   // height px
        LV_ALIGN_TOP_RIGHT,   // alignment
        -184,                 // pos x
        90,                   // pos y
        "L",                  // label text
        LV_TEXT_ALIGN_CENTER, // text align
        false,                // show scrollbar
        false,                // enable scrolling
        &cobalt_alien_17,     // font for labels,
        radius_rounded,
        default_btn_bg,
        default_btn_on_value_hue
    );
    lv_obj_add_event_cb(matrix_load.button, matrix_load_event_cb, LV_EVENT_CLICKED, NULL);

    // Delete Matrix
    matrix_delete = create_button(
        matrix_screen,        // parent
        34,                   // width px
        34,                   // height px
        LV_ALIGN_TOP_RIGHT,   // alignment
        -130,                 // pos x
        90,                   // pos y
        "D",                  // label text
        LV_TEXT_ALIGN_CENTER, // text align
        false,                // show scrollbar
        false,                // enable scrolling
        &cobalt_alien_17,     // font for labels,
        radius_rounded,
        default_btn_bg,
        default_btn_on_value_hue
    );
    lv_obj_add_event_cb(matrix_delete.button, matrix_delete_event_cb, LV_EVENT_CLICKED, NULL);
}

/** -------------------------------------------------------------------------------------
 * @brief Show GPS Screen.
 */
void display_gps_screen()
{
    // Set Display Flag
    flag_display_gps_screen = false;

    // Check Current Screen
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == gps_screen) {
        return;
    }

    current_screen_number = GPS_SCREEN;

    // Always create a fresh screen
    gps_screen = lv_obj_create(NULL);
    
    // Load screen
    lv_scr_load_anim(gps_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    // Defaults
    create_default_screen_objects(gps_screen);

    current_gps_panel=0;

    // GPS Switch Panel
    gps_switch_panel = create_gps_switch_panel(
        gps_screen,       // parent
        450,              // width px
        40+(4*2),         // height px
        LV_ALIGN_TOP_MID, // alignment
        0,                // pos x
        95,               // pos y
        radius_rounded,   // radius
        1,                // outer_pad_all
        1,                // inner_pad_all
        1,                // outline_padding
        1,                // main_row_padding
        1,                // main_column_padding
        1,                // sub_row_padding
        10,               // sub_column_padding
        48,               // row height
        false,            // show scrollbar
        false,            // enable scrolling
        &cobalt_alien_25, // font for titles,
        &cobalt_alien_17  // font for text,
    );

    // SATIO
    satio_c = create_satio_panel(
        gps_screen,        // parent
        general_menu_w_px, // width px
        general_menu_h_px, // height px
        LV_ALIGN_CENTER,   // alignment
        0,                 // pos x
        0,                 // pos y
        radius_rounded,    // radius
        2,                 // outer_pad_all
        4,                 // inner_pad_all
        2,                 // outline_padding
        2,                 // main_row_padding
        4,                 // main_column_padding
        2,                 // sub_row_padding
        8,                 // sub_column_padding
        general_menu_row_h_px, // row height
        true,              // show scrollbar
        true,              // enable scrolling
        &cobalt_alien_25,  // font for titles,
        &cobalt_alien_17   // font for text,
    );

    // GNGGA
    gngga_c = create_gngga_panel(
        gps_screen,        // parent
        general_menu_w_px, // width px
        general_menu_h_px, // height px
        LV_ALIGN_CENTER,   // alignment
        0,                 // pos x
        0,                 // pos y
        radius_rounded,    // radius
        2,                 // outer_pad_all
        4,                 // inner_pad_all
        2,                 // outline_padding
        2,                 // main_row_padding
        4,                 // main_column_padding
        2,                 // sub_row_padding
        8,                 // sub_column_padding
        general_menu_row_h_px, // row height
        true,              // show scrollbar
        true,              // enable scrolling
        &cobalt_alien_25,  // font for titles,
        &cobalt_alien_17   // font for text,
    );

    // GNRMC
    gnrmc_c = create_gnrmc_panel(
        gps_screen,        // parent
        general_menu_w_px, // width px
        general_menu_h_px, // height px
        LV_ALIGN_CENTER,   // alignment
        0,                 // pos x
        0,                 // pos y
        radius_rounded,    // radius
        2,                 // outer_pad_all
        4,                 // inner_pad_all
        2,                 // outline_padding
        2,                 // main_row_padding
        4,                 // main_column_padding
        2,                 // sub_row_padding
        8,                 // sub_column_padding
        general_menu_row_h_px, // row height
        true,              // show scrollbar
        true,              // enable scrolling
        &cobalt_alien_25,  // font for titles,
        &cobalt_alien_17   // font for text,
    );

    // GPATT
    gpatt_c = create_gpatt_panel(
        gps_screen,        // parent
        general_menu_w_px, // width px
        general_menu_h_px, // height px
        LV_ALIGN_CENTER,   // alignment
        0,                 // pos x
        0,                 // pos y
        radius_rounded,    // radius
        2,                 // outer_pad_all
        4,                 // inner_pad_all
        2,                 // outline_padding
        2,                 // main_row_padding
        4,                 // main_column_padding
        2,                 // sub_row_padding
        8,                 // sub_column_padding
        general_menu_row_h_px, // row height
        true,              // show scrollbar
        true,              // enable scrolling
        &cobalt_alien_25,  // font for titles,
        &cobalt_alien_17   // font for text,
    );
}

/** -------------------------------------------------------------------------------------
 * @brief Show Gyro Screen.
 */
void display_gyro_screen()
{
    // Set Display Flag
    flag_display_gyro_screen = false;

    // Check Current Screen
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == gyro_screen) {
        return;
    }

    current_screen_number = GYRO_SCREEN;

