holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
    // Always create a fresh screen
    gyro_screen = lv_obj_create(NULL);
    
    // Load screen
    lv_scr_load_anim(gyro_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    // Defaults
    create_default_screen_objects(gyro_screen);

    // Gyro
    gyro_0_c = create_gyro_panel(
        gyro_screen,      // parent
        650,              // width px
        (general_menu_row_h_px*5)-(outline_width*2)-(2*2), // height px
        LV_ALIGN_CENTER,  // alignment
        0,                // pos x
        0,                // pos y
        radius_rounded,   // radius
        2,                // outer_pad_all
        4,                // inner_pad_all
        2,                // outline_padding
        2,                // main_row_padding
        4,                // main_column_padding
        2,                // sub_row_padding
        8,                // sub_column_padding
        general_menu_row_h_px, // row height
        true,             // show scrollbar
        true,             // enable scrolling
        &cobalt_alien_25, // font for titles,
        &cobalt_alien_17  // font for text,
    );

    // Calibrate Gyro -> Button starts timer -> calibration ends on timeout.

    // Calibrate Magnetic Field -> Button starts timer -> calibration ends on timeout.
}

/** -------------------------------------------------------------------------------------
 * @brief Show System Settings Screen.
 */
void display_mplex0_screen()
{
    // Set Display Flag
    flag_display_mplex0_screen = false;

    // Check Current Screen
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == mplex0_screen) {
        return;
    }

    current_screen_number = MPLEX0_SCREEN;

    // Always create a fresh screen
    mplex0_screen = lv_obj_create(NULL);
    
    // Load screen
    lv_scr_load_anim(mplex0_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    // Defaults
    create_default_screen_objects(mplex0_screen);

    // Admplex 0
    admlpex0_c = create_admplex0_panel(
        mplex0_screen,     // parent
        general_menu_w_px, // width px
        general_menu_h_px, // height px
        LV_ALIGN_CENTER,   // alignment
        0,                 // pos x
        0,                 // pos y
        radius_rounded,    // radius
        2,                 // outer_pad_all
        4,                 // inner_pad_all
        2,                 // outline_padding
        2,                 // main_row_padding
        4,                 // main_column_padding
        2,                 // sub_row_padding
        8,                 // sub_column_padding
        general_menu_row_h_px, // row height
        true,              // show scrollbar
        true,              // enable scrolling
        &cobalt_alien_25,  // font for titles,
        &cobalt_alien_17   // font for text,
    );
}

/** -------------------------------------------------------------------------------------
 * @brief Show Serial Screen.
 */
void display_serial_screen()
{
    // Set Display Flag
    flag_display_serial_screen = false;

    // Check Current Screen
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == serial_screen) {
        return;
    }

    current_screen_number = SERIAL_SCREEN;

    // Always create a fresh screen
    serial_screen = lv_obj_create(NULL);
    
    // Load screen
    lv_scr_load_anim(serial_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    // Defaults
    create_default_screen_objects(serial_screen);

    // Serial
    serial_c = create_serial_panel(
        serial_screen,     // parent
        general_menu_w_px, // width px
        general_menu_h_px, // height px
        LV_ALIGN_CENTER,   // alignment
        0,                 // pos x
        0,                 // pos y
        radius_rounded,    // radius
        2,                 // outer_pad_all
        4,                 // inner_pad_all
        2,                 // outline_padding
        2,                 // main_row_padding
        4,                 // main_column_padding
        2,                 // sub_row_padding
        8,                 // sub_column_padding
        general_menu_row_h_px, // row height
        true,              // show scrollbar
        true,              // enable scrolling
        &cobalt_alien_25,  // font for titles,
        &cobalt_alien_17   // font for text,
    );
}

/** -------------------------------------------------------------------------------------
 * @brief Show UAP Screen.
 */
void display_uap_screen()
{
    // Set Display Flag
    flag_display_uap_screen = false;

    // Check Current Screen
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == uap_screen) {
        return;
    }

    current_screen_number = UAP_SCREEN;

    // Always create a fresh screen
    uap_screen = lv_obj_create(NULL);
    
    // Load screen
    lv_scr_load_anim(uap_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);

    // Defaults
    create_default_screen_objects(uap_screen);

    // create UAP
    uap_c = create_uap(
        uap_screen,
        500,
        500,
        LV_ALIGN_CENTER,
        0,
        0,
        general_radius
    );
}

/** -------------------------------------------------------------------------------------
 * @brief Blank diagnostic screen: title bar + system tray only, no other content.
 *        Use this screen to measure baseline FPS with minimal rendering overhead.
 */
void display_baseline_screen() {

    // Set Display Flag
    flag_display_baseline_screen = false;

    // Check Current Screen
    lv_obj_t * current_screen = lv_scr_act();
    if (current_screen == baseline_screen) {
        return;
    }

    current_screen_number = BASELINE_SCREEN;

    // Always create a fresh screen
    baseline_screen = lv_obj_create(NULL);

    // Load screen
    lv_scr_load_anim(baseline_screen, LV_SCR_LOAD_ANIM_NONE, 300, 0, true);
    create_default_screen_objects(baseline_screen);
}

/** -------------------------------------------------------------------------------------
 * @brief Wrapper around lv_dropdown_set_selected that reads the current selection
 *        first and skips the call when the index is already correct.  Each
 *        lv_dropdown_set_selected() unconditionally invalidates the widget and
 *        queues a re-render; avoiding redundant calls is the primary lever for
 *        keeping FPS high on screens with many static dropdown widgets.
 */
static void dd_select(lv_obj_t *dd, uint32_t idx) {
    bool result = false;
    if (dd != NULL) {
        result = (lv_dropdown_get_selected(dd) != (uint16_t)idx);
    }
    if (result) { lv_dropdown_set_selected(dd, idx); }
}

/** -------------------------------------------------------------------------------------
 * @brief Main function to update screen objects and load screens.
 */
void update_display()
{

    // ---------------------
    // Rainbow Effect
    // ---------------------
    // Advance hue every 3 frames.  When the hue is unchanged, the 6 rainbow
    // colors below stay the same; lv_obj_set_style_* calls with an identical
    // color are a no-op in LVGL 9, so rainbow-coloured widgets are not
    // re-rendered in the intervening frames.
    static uint8_t rainbow_frame_ctr = 0U;
    if (rainbow_frame_ctr == 0U) { current_hue = (current_hue + 1) % 360; }
    rainbow_frame_ctr = (rainbow_frame_ctr + 1U) % 3U;
    // Rainbow Major
    rainbow_outline_hue = lv_color_hsv_to_rgb((current_hue + 300) % 360, 100, 100);
    rainbow_title_hue   = lv_color_hsv_to_rgb((current_hue + 250) % 360, 100, 100);
    rainbow_value_hue   = lv_color_hsv_to_rgb((current_hue + 200) % 360, 100, 100);
    // Rainbow Minor
    rainbow_contrast_outline_hue = lv_color_hsv_to_rgb((current_hue + 150) % 360, 100, 100);
    rainbow_contrast_title_hue   = lv_color_hsv_to_rgb((current_hue + 100) % 360, 100, 100);
    rainbow_contrast_value_hue   = lv_color_hsv_to_rgb((current_hue + 50) % 360, 100, 100);

    // ---------------------
    // Check Load Screen Flags
    // ---------------------
    if (flag_display_home_screen==true) {display_home_screen();}
    else if (flag_display_matrix_screen==true) {display_matrix_screen();}
    else if (flag_display_gps_screen==true) {display_gps_screen();}
    else if (flag_display_gyro_screen==true) {display_gyro_screen();}
    else if (flag_display_mplex0_screen==true) {display_mplex0_screen();}
    else if (flag_display_serial_screen==true) {display_serial_screen();}
    else if (flag_display_uap_screen==true) {display_uap_screen();}
    else if (flag_display_baseline_screen==true) {display_baseline_screen();}
    
    // ---------------------
    // KB Alnumsym
    // ---------------------
    if (kb_alnumsym.kb != NULL && lv_obj_is_valid(kb_alnumsym.kb)) {
        if (!lv_obj_has_flag(kb_alnumsym.kb, LV_OBJ_FLAG_HIDDEN)) {
            // Rainbow keyboard full outline
            lv_obj_set_style_outline_color(kb_alnumsym.kb, rainbow_outline_hue, LV_PART_MAIN);
            // Rainbow keyboard full keys
            lv_obj_set_style_text_color(kb_alnumsym.kb, rainbow_title_hue, LV_PART_ITEMS);
            // Rainbow keyboard full checked keys
            lv_obj_set_style_text_color(kb_alnumsym.kb, rainbow_value_hue, LV_PART_ITEMS | LV_STATE_CHECKED);
            // Rainbow keyboard full text area outline
            lv_obj_set_style_outline_color(kb_alnumsym.ta, rainbow_outline_hue, LV_PART_MAIN);
            // Rainbow keyboard full text area text
            lv_obj_set_style_text_color(kb_alnumsym.ta, rainbow_value_hue, LV_PART_MAIN);
        }
    }
    // ---------------------
    // KB Numdedc
    // ---------------------
    if (kb_numdec.kb != NULL && lv_obj_is_valid(kb_numdec.kb)) {
        if (!lv_obj_has_flag(kb_numdec.kb, LV_OBJ_FLAG_HIDDEN)) {
            // Rainbow keyboard numdec full outline
            lv_obj_set_style_outline_color(kb_numdec.kb, rainbow_outline_hue, LV_PART_MAIN);
            // Rainbow keyboard numdec full keys
            lv_obj_set_style_text_color(kb_numdec.kb, rainbow_title_hue, LV_PART_ITEMS);
            // Rainbow keyboard numdec full checked keys
            lv_obj_set_style_text_color(kb_numdec.kb, rainbow_value_hue, LV_PART_ITEMS | LV_STATE_CHECKED);
            // Rainbow keyboard numdec full text area outline
            lv_obj_set_style_outline_color(kb_numdec.ta, rainbow_outline_hue, LV_PART_MAIN);
            // Rainbow keyboard numdec full text area text
            lv_obj_set_style_text_color(kb_numdec.ta, rainbow_value_hue, LV_PART_MAIN);
        }
    }
    
    // ---------------------
    // Title Bar
    // ---------------------
    if (main_title_bar.panel) {

        // Title Bar Outline
        lv_obj_set_style_outline_color(main_title_bar.panel, rainbow_outline_hue, LV_PART_MAIN);

        // Title Bar Local Time
        lv_label_set_text(main_title_bar.time_label, satioData.formatted_local_time_HHMMSS);
        lv_obj_set_style_text_color(main_title_bar.time_label, rainbow_title_hue, LV_PART_MAIN);

        // Title Bar Local Date
        lv_label_set_text(main_title_bar.date_label, satioData.formatted_local_short_date_DDMMYY);
        lv_obj_set_style_text_color(main_title_bar.date_label, rainbow_title_hue, LV_PART_MAIN);

        // GPS Sync
        if (satioData.gps_sync) {
            lv_obj_add_flag(main_title_bar.gps_signal_strength, LV_OBJ_FLAG_HIDDEN);
            lv_obj_remove_flag(main_title_bar.datetime_sync, LV_OBJ_FLAG_HIDDEN);
            lv_obj_set_style_outline_color(main_title_bar.datetime_sync, lv_color_make(0, 255, 0), LV_PART_MAIN);
            lv_obj_set_style_text_color(main_title_bar.datetime_sync, lv_color_make(0, 255, 0), LV_PART_MAIN);
        }
        // GPS Signal
        else {
            lv_obj_add_flag(main_title_bar.datetime_sync, LV_OBJ_FLAG_HIDDEN);
            lv_obj_remove_flag(main_title_bar.gps_signal_strength, LV_OBJ_FLAG_HIDDEN);
            { char gps_sig[MAX_GLOBAL_ELEMENT_SIZE*3]; snprintf(gps_sig, sizeof(gps_sig), "%d:%.1f", atoi(gnggaData.satellite_count), atof(gnggaData.gps_precision_factor)); lv_label_set_text(main_title_bar.gps_signal_strength, gps_sig); }
            lv_obj_set_style_outline_color(main_title_bar.gps_signal_strength, rainbow_contrast_outline_hue, LV_PART_MAIN);
            lv_obj_set_style_text_color(main_title_bar.gps_signal_strength, rainbow_contrast_title_hue, LV_PART_MAIN);
        }

        // SD Card Mounted / Success Flag
        if (sdcardFlagData.success_flag==2) {
            lv_obj_set_style_outline_color(main_title_bar.sdcard_mounted, lv_color_make(0, 255, 0), LV_PART_MAIN);
            lv_obj_set_style_text_color(main_title_bar.sdcard_mounted, lv_color_make(0, 255, 0), LV_PART_MAIN);
            lv_label_set_text(main_title_bar.sdcard_mounted, "ok");
        }
        else if (sdcardFlagData.success_flag==1) {
            lv_obj_set_style_outline_color(main_title_bar.sdcard_mounted, lv_color_make(255, 0, 0), LV_PART_MAIN);
            lv_obj_set_style_text_color(main_title_bar.sdcard_mounted, lv_color_make(255, 0, 0), LV_PART_MAIN);
            lv_label_set_text(main_title_bar.sdcard_mounted, "!");
        }
        else {
            if (sdcardData.sdcard_mounted) {
                lv_obj_set_style_outline_color(main_title_bar.sdcard_mounted, main_outline_hue, LV_PART_MAIN);
                lv_obj_set_style_text_color(main_title_bar.sdcard_mounted, rainbow_contrast_title_hue, LV_PART_MAIN);
                lv_label_set_text(main_title_bar.sdcard_mounted, "SD");
            }
            else {
                lv_obj_set_style_outline_color(main_title_bar.sdcard_mounted, main_outline_hue, LV_PART_MAIN);
                lv_obj_set_style_text_color(main_title_bar.sdcard_mounted, rainbow_contrast_title_hue, LV_PART_MAIN);
                lv_label_set_text(main_title_bar.sdcard_mounted, "SD!");
            }
        }
    }

    // ---------------------
    // System Tray
    // ---------------------
    if (system_tray.is_open) {

        // Rainbow System Tray Outline
        lv_obj_set_style_outline_color(system_tray.panel, rainbow_outline_hue, LV_PART_MAIN);

        // Rainbow System Tray Brightness Slider Outline
        lv_obj_set_style_outline_color(system_tray.slider_brightness, rainbow_contrast_outline_hue, LV_PART_MAIN);

        // Rainbow System Tray Brightness Slider Knob
        lv_obj_set_style_bg_color(system_tray.slider_brightness, rainbow_contrast_value_hue, LV_PART_KNOB);

        // Rainbow System Tray Brightness Slider Indicator
        lv_obj_set_style_outline_color(system_tray.slider_brightness, rainbow_contrast_outline_hue, LV_PART_INDICATOR);

