holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
            if (mcc.panel) {
                lv_obj_set_flag(matrix_overview_grid_1, LV_OBJ_FLAG_HIDDEN, true);
                lv_obj_set_flag(mfc.panel, LV_OBJ_FLAG_HIDDEN, true);
                lv_obj_set_flag(mcc.panel, LV_OBJ_FLAG_HIDDEN, false);

                // Map Slot
                dd_select(mcc.dd_slot, current_mapping_i);

                dd_select(mcc.dd_c0, (uint32_t)mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C0]);

                { char buf[MAX_GLOBAL_ELEMENT_SIZE]; snprintf(buf, sizeof(buf), "%d", (int)mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C1]); lv_label_set_text(mcc.val_c1, buf); }

                { char buf[MAX_GLOBAL_ELEMENT_SIZE]; snprintf(buf, sizeof(buf), "%d", (int)mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C2]); lv_label_set_text(mcc.val_c2, buf); }

                { char buf[MAX_GLOBAL_ELEMENT_SIZE]; snprintf(buf, sizeof(buf), "%d", (int)mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C3]); lv_label_set_text(mcc.val_c3, buf); }

                { char buf[MAX_GLOBAL_ELEMENT_SIZE]; snprintf(buf, sizeof(buf), "%d", (int)mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C4]); lv_label_set_text(mcc.val_c4, buf); }

                { char buf[MAX_GLOBAL_ELEMENT_SIZE]; snprintf(buf, sizeof(buf), "%d", (int)mappingData.mapping_config[0][current_mapping_i][INDEX_MAP_C5]); lv_label_set_text(mcc.val_c5, buf); }

                dd_select(mcc.dd_mode, (uint32_t)mappingData.map_mode[0][current_mapping_i]);

                { char buf[MAX_GLOBAL_ELEMENT_SIZE]; snprintf(buf, sizeof(buf), "%f", get_mapping_input_value(current_mapping_i)); lv_label_set_text(mcc.value_input, buf); }

                { char buf[MAX_GLOBAL_ELEMENT_SIZE]; snprintf(buf, sizeof(buf), "%d", (int)mappingData.mapped_value[0][current_mapping_i]); lv_label_set_text(mcc.value_map_result, buf); }
            }
        }
    }
    // ---------------------
    // gps screen
    // ---------------------
    else if (current_screen_number == GPS_SCREEN) {

        if (current_gps_panel == 0) {
            if (satio_c.panel) {
                // Hide
                lv_obj_add_flag(gngga_c.panel, LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(gnrmc_c.panel, LV_OBJ_FLAG_HIDDEN);
                lv_obj_add_flag(gpatt_c.panel, LV_OBJ_FLAG_HIDDEN);

                // Show
                lv_obj_remove_flag(satio_c.panel, LV_OBJ_FLAG_HIDDEN);

                // Switch Panel
                lv_obj_set_style_text_color(gps_switch_panel.switch_satio_panel.label, rainbow_contrast_value_hue, LV_PART_MAIN);
                lv_obj_set_style_bg_color(gps_switch_panel.switch_satio_panel.panel, default_btn_on_bg, LV_PART_MAIN);

                lv_obj_set_style_text_color(gps_switch_panel.switch_gngga_panel.label, default_btn_off_value_hue, LV_PART_MAIN);
                lv_obj_set_style_bg_color(gps_switch_panel.switch_gngga_panel.panel, default_btn_off_bg, LV_PART_MAIN);

                lv_obj_set_style_text_color(gps_switch_panel.switch_gnrmc_panel.label, default_btn_off_value_hue, LV_PART_MAIN);
                lv_obj_set_style_bg_color(gps_switch_panel.switch_gnrmc_panel.panel, default_btn_off_bg, LV_PART_MAIN);

                lv_obj_set_style_text_color(gps_switch_panel.switch_gpatt_panel.label, default_btn_off_value_hue, LV_PART_MAIN);
                lv_obj_set_style_bg_color(gps_switch_panel.switch_gpatt_panel.panel, default_btn_off_bg, LV_PART_MAIN);

                // Panel
                lv_obj_set_style_outline_color(satio_c.panel, default_outline_hue, LV_PART_MAIN);

                // ────────────────────────────────────────────────
                // GPS Degrees Latitude
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_deg_lat, String(satioData.degrees_latitude, 7).c_str());

                // ────────────────────────────────────────────────
                // GPS Degrees Longitude
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_deg_lon, String(satioData.degrees_longitude, 7).c_str());

                // ────────────────────────────────────────────────
                // User Degrees Latitude
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_user_deg_lat, String(satioData.user_degrees_latitude, 7).c_str());

                // ────────────────────────────────────────────────
                // User Degrees Longitude
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_user_deg_lon, String(satioData.user_degrees_longitude, 7).c_str());

                // ────────────────────────────────────────────────
                // System Degrees Latitude
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_sys_deg_lat, String(satioData.system_degrees_latitude, 7).c_str());

                // ────────────────────────────────────────────────
                // System Degrees Longitude
                // ────────────────────────────────────────────────
                lv_label_set_text(satio_c.val_sys_deg_lon, String(satioData.system_degrees_longitude, 7).c_str());

                // ────────────────────────────────────────────────
                // Location Value Mode
                // ────────────────────────────────────────────────
                if (satioData.location_value_mode==SATIO_MODE_GPS) {
                    // User lowlight
                    lv_obj_set_style_outline_color(satio_c.btn_location_mode_user.panel, default_btn_off_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_bg_color(satio_c.btn_location_mode_user.panel, default_btn_off_bg, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_location_mode_user.label, default_btn_off_value_hue, LV_PART_MAIN);
                    // GPS emphasis
                    lv_obj_set_style_outline_color(satio_c.btn_location_mode_gps.panel, default_btn_on_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_bg_color(satio_c.btn_location_mode_gps.panel, default_btn_on_bg, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_location_mode_gps.label, rainbow_contrast_value_hue, LV_PART_MAIN);
                }
                else if (satioData.location_value_mode==SATIO_MODE_USER) {
                    // GPS lowlight
                    lv_obj_set_style_outline_color(satio_c.btn_location_mode_gps.panel, default_btn_off_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_bg_color(satio_c.btn_location_mode_gps.panel, default_btn_off_bg, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_location_mode_gps.label, default_btn_off_value_hue, LV_PART_MAIN);
                    // User emphasis
                    lv_obj_set_style_outline_color(satio_c.btn_location_mode_user.panel, default_btn_on_outline_hue, LV_PART_MAIN);
                    lv_obj_set_style_bg_color(satio_c.btn_location_mode_user.panel, default_btn_on_bg, LV_PART_MAIN);
                    lv_obj_set_style_text_color(satio_c.btn_location_mode_user.label, rainbow_contrast_value_hue, LV_PART_MAIN);
                }


