holographicSol/SatIO_ESPIDF_Waveshare_ESP32-P4_Round_Display/satio_lvgl.cpp
            // ────────────────────────────────────────────────
            // Acceleration
            // ────────────────────────────────────────────────
            lv_label_set_text(gyro_0_c.val_gyro_0_acc_x, String(gyroData.gyro_0_acc_x).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_acc_y, String(gyroData.gyro_0_acc_y).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_acc_z, String(gyroData.gyro_0_acc_z).c_str());

            // ────────────────────────────────────────────────
            // Gyroscope 
            // ────────────────────────────────────────────────
            lv_label_set_text(gyro_0_c.val_gyro_0_gyr_x, String(gyroData.gyro_0_gyr_x).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_gyr_y, String(gyroData.gyro_0_gyr_y).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_gyr_z, String(gyroData.gyro_0_gyr_z).c_str());

            // ────────────────────────────────────────────────
            // Magnetometer 
            // ────────────────────────────────────────────────
            lv_label_set_text(gyro_0_c.val_gyro_0_mag_x, String(gyroData.gyro_0_mag_x).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_mag_y, String(gyroData.gyro_0_mag_y).c_str());
            lv_label_set_text(gyro_0_c.val_gyro_0_mag_z, String(gyroData.gyro_0_mag_z).c_str());

            // ────────────────────────────────────────────────
            // Current UI Baud Rate
            // ────────────────────────────────────────────────
            lv_label_set_text(gyro_0_c.val_gyro_0_current_uiBaud, String(gyroData.gyro_0_current_uiBaud).c_str());
        }
    }

    // ---------------------
    // MPlex screen
    // ---------------------
    else if (current_screen_number == MPLEX0_SCREEN) {
        if (admlpex0_c.panel) {
            lv_label_set_text(admlpex0_c.lbl_val_chan_0,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_0]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_1,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_1]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_2,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_2]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_3,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_3]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_4,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_4]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_5,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_5]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_6,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_6]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_7,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_7]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_8,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_8]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_9,  String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_9]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_10, String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_10]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_11, String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_11]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_12, String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_12]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_13, String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_13]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_14, String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_14]).c_str());
            lv_label_set_text(admlpex0_c.lbl_val_chan_15, String(ad_mux_0.data[INDEX_ADMPLEX_0_CH_15]).c_str());
        }
    }

    // ---------------------
    // UAP screen
    // ---------------------
    else if (current_screen_number == UAP_SCREEN) {
        
        // ────────────────────────────────────────────────
        // Roll
        // ────────────────────────────────────────────────
        if (uap_c.roll_panel) {
            lv_obj_set_style_transform_rotation(uap_c.roll_panel, (int32_t)gyroData.gyro_0_ang_x*10, LV_PART_MAIN);
        }

        // ────────────────────────────────────────────────
        // Pitch
        // ────────────────────────────────────────────────
        if (uap_c.pitch_panel) {
            // move slider
        }

        // ────────────────────────────────────────────────
        // Yaw
        // ────────────────────────────────────────────────
        if (uap_c.yaw_panel) {
            // move slider
        }

        lv_label_set_text(uap_c.latitude_label, String("LAT " + String(satioData.degrees_latitude, 7)).c_str());
        lv_label_set_text(uap_c.longitude_label, String("LON " + String(satioData.degrees_longitude, 7)).c_str());
        lv_label_set_text(uap_c.altitude_label, String("ALT " + String(satioData.altitude, 2)).c_str());
        lv_label_set_text(uap_c.speed_label, String("SPD " + String(satioData.speed, 2)).c_str());
    }

    // ---------------------
    // baseline screen
    // ---------------------
    else if (current_screen_number == BASELINE_SCREEN) {
    }
}

/** -------------------------------------------------------------------------------------
 * @brief Sets global color scheme to default color scheme
 */
void setColorsDefault()
{
    main_bg_hue      = default_bg_hue;
    main_outline_hue = default_outline_hue;
    main_border_hue  = default_border_hue;
    main_shadow_hue  = default_shadow_hue;
    main_title_hue   = default_title_hue;
    main_value_hue   = default_value_hue;
}

/** -------------------------------------------------------------------------------------
 * @brief Sets global color scheme to custom color scheme
 */
void setColorsCustom()
{
    main_bg_hue      = custom_bg_hue;
    main_outline_hue = custom_outline_hue;
    main_border_hue  = custom_border_hue;
    main_shadow_hue  = custom_shadow_hue;
    main_title_hue   = custom_title_hue;
    main_value_hue   = custom_value_hue;
}

/** -------------------------------------------------------------------------------------
 * @brief Initialize LVGL for this device.
 */
void initSatIOUI() {
    // --------------------------------------------------------------
    // LVGL Initialization
    // --------------------------------------------------------------
    ESP_LOGI("LVGL", "Version: %d.%d.%d", LVGL_VERSION_MAJOR, LVGL_VERSION_MINOR, LVGL_VERSION_PATCH);

    delay(1000);
    
    // Initialize LVGL display object via BSP
    lv_display_t *disp = bsp_display_start();
    if (!disp) {ESP_LOGE("APP", "Failed to initialize display");}
    ESP_LOGI("APP", "Display initialized successfully");
    
    // Give BSP task time to fully initialize LVGL
    vTaskDelay(pdMS_TO_TICKS(1000));

    // Set LVGL tick period
    lv_timer_set_period(lv_timer_get_next(NULL), POWER_CONFIG_BALANCED_DELAY_TASK_DISPLAY);  // ms
    
    // Initialize display brightness and backlight
    bsp_display_brightness_init();
    bsp_display_backlight_on();
    slider_brightness_value = 100;
    bsp_display_brightness_set(slider_brightness_value);

